3B/SE464/02-Design-Principles.tex
% Created 2024-12-05 Thu 01:05
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Design Principles}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Design Principles},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Design Principles}
\label{sec:org6576bf5}
\textbf{UML}: general purpose modeling language for object-oriented software systems

UML used informally in practice.

Design principles ease communication, leverage existing design knowledge,
enhance flexibility for future change, and increase reusability of developed code.

Gang of Four Design Patterns:
\begin{itemize}
\item Class, Creational \(\to\) Factory Method
\item Class, Structural \(\to\) Adapter (class)
\item Class, Behavioural \(\to\) Interpreter, Template Method
\item Object, Creational \(\to\) Abstract Factory, Builder, Prototype, Singleton
\item Object, Structural \(\to\) Adapter (object), Bridge, Composite, Decorator,
Facade, Flyweight, Proxy
\item Object, Behavioural \(\to\) Chain of Responsibility, Command, Iterator, Mediator,
Memento, Observer, State, Strategy, Visitor
\end{itemize}
\section{Single Responsibility Principle and Class Cohesion}
\label{sec:orga7e9c73}
\textbf{Single Responsibility Principle}: a class should have one and only one reason to change

Gives \uline{high cohesion} between class members and \uline{better segregation of concerns}.

\textbf{Class cohesion}: public methods of a class must be closely aligned to each other in
behaviour
\begin{itemize}
\item methods should access common fields
\item methods should call each other for desired functionality
\end{itemize}

To follow SRP, a class cannot expose unnecessary public methods to clients (pertains to
segregation of concerns).

If different clients use different disjoint subsets of methods, separate these into different
classes.
\section{Open Closed Principle}
\label{sec:org4d8fe1e}
Software entities (class, methods) should be open for extension (inheritance) but
closed for modification (once tested and in production).

Gives \uline{low coupling} between program, clients, and other dependent programs and
promotes \uline{flexible, extensible, and reusable} development (better speed, lower cost).

Possible through abstractions.
\section{Liskov Substitution Principle}
\label{sec:org1c05336}
References to the base class must be completely substitutable by references of any
derived classes.

Rules:
\begin{enumerate}
\item \uline{Invariants} of supertype must not be violated or broken by subtype.
\item \uline{Preconditions} on overridden methods of subtype must be subset of preconditions
on the same method for the supertype.
\item \uline{Postconditions} on overridden methods of subtype must be superset of postconditions
on the same method for the supertype.
\end{enumerate}

Violated if:
\begin{itemize}
\item a overridden method does nothing or just throws an exception
\item subtype method modifies a field of the superclass, which is not exposed through a
setter
\end{itemize}
\section{Interface Segregation Principle}
\label{sec:org166af27}
Client must not be forced to use interfaces that it does not need.

Gives readable, refactorable, and manageable code and promotes \uline{high cohesion} for classes
implementing the interface.

Advocates splitting large interfaces into smaller interfaces (role interfaces vs
fat/polluted interface).

Violated if:
\begin{itemize}
\item a class implements an interface but some interface methods are not required and are
implemented with empty body or return null/throw exception
\end{itemize}

Each method implemented must define a concrete behaviour for the class.
\section{Dependency Inversion Principle}
\label{sec:org8659b05}
High level modules should not depend on low level modules. Instead, both should depend
upon abstractions.
Abstractions should not depend on details, instead details should depend upon
abstractions.

Violated if:
\begin{itemize}
\item layered architecture: one layer sensitive to changes in another layer
\begin{itemize}
\item instead use an interface that both layers use
\end{itemize}
\end{itemize}
\end{document}
